In [38]:
import pandas as pd

In [39]:
df = pd.read_csv('df2023.csv')

In [40]:
df['date'] = pd.to_datetime(df['date'])

In [41]:
df['min'] = df['min'].str.replace('Rs ', '').str.replace(',', '').astype(float)
df['max'] = df['max'].str.replace('Rs ', '').str.replace(',', '').astype(float)
df['avg'] = df['avg'].str.replace('Rs ', '').str.replace(',', '').astype(float)

In [42]:
df.head()

       product       date    min    max    avg
0         Amla 2023-01-01   60.0   70.0   65.0
1  Apple(Fuji) 2023-01-01  240.0  280.0  260.0
2         Arum 2023-01-01   40.0   50.0   45.0
3    Asparagus 2023-01-01    0.0    0.0    0.0
4      Avocado 2023-01-01  300.0  350.0  325.0

In [43]:
df.to_csv('df23.csv', index= False)

In [49]:
df = pd.read_csv('df.csv')

In [50]:
df.head()

              Commodity Unit   Minimum   Maximum   Average        Date
0    Tomato Big(Nepali)   KG  Rs 50.00  Rs 60.00  Rs 55.00  2024-03-13
1    Tomato Big(Indian)   KG  Rs 50.00  Rs 60.00  Rs 55.00  2024-03-13
2   Tomato Small(Local)   KG  Rs 20.00  Rs 30.00  Rs 25.00  2024-03-13
3  Tomato Small(Tunnel)   KG  Rs 25.00  Rs 35.00  Rs 30.00  2024-03-13
4  Tomato Small(Indian)   KG  Rs 25.00  Rs 35.00  Rs 30.00  2024-03-13

In [51]:
df.rename(columns={'Commodity': 'product', 'Date': 'date', 'Minimum': 'min', 'Maximum': 'max', 'Average': 'avg'}, inplace=True)

In [52]:
df.head()

                product Unit       min       max       avg        date
0    Tomato Big(Nepali)   KG  Rs 50.00  Rs 60.00  Rs 55.00  2024-03-13
1    Tomato Big(Indian)   KG  Rs 50.00  Rs 60.00  Rs 55.00  2024-03-13
2   Tomato Small(Local)   KG  Rs 20.00  Rs 30.00  Rs 25.00  2024-03-13
3  Tomato Small(Tunnel)   KG  Rs 25.00  Rs 35.00  Rs 30.00  2024-03-13
4  Tomato Small(Indian)   KG  Rs 25.00  Rs 35.00  Rs 30.00  2024-03-13

In [53]:
df.drop(columns=['Unit'], inplace=True)

In [54]:
df.head()

                product       min       max       avg        date
0    Tomato Big(Nepali)  Rs 50.00  Rs 60.00  Rs 55.00  2024-03-13
1    Tomato Big(Indian)  Rs 50.00  Rs 60.00  Rs 55.00  2024-03-13
2   Tomato Small(Local)  Rs 20.00  Rs 30.00  Rs 25.00  2024-03-13
3  Tomato Small(Tunnel)  Rs 25.00  Rs 35.00  Rs 30.00  2024-03-13
4  Tomato Small(Indian)  Rs 25.00  Rs 35.00  Rs 30.00  2024-03-13

In [55]:
df['min'] = df['min'].str.replace('Rs ', '').str.replace(',', '').astype(float)
df['max'] = df['max'].str.replace('Rs ', '').str.replace(',', '').astype(float)
df['avg'] = df['avg'].str.replace('Rs ', '').str.replace(',', '').astype(float)

In [56]:
df['date'] = pd.to_datetime(df['date'])

In [57]:
df.head()

                product   min   max   avg       date
0    Tomato Big(Nepali)  50.0  60.0  55.0 2024-03-13
1    Tomato Big(Indian)  50.0  60.0  55.0 2024-03-13
2   Tomato Small(Local)  20.0  30.0  25.0 2024-03-13
3  Tomato Small(Tunnel)  25.0  35.0  30.0 2024-03-13
4  Tomato Small(Indian)  25.0  35.0  30.0 2024-03-13

In [58]:
df = df[['product', 'date', 'min', 'max', 'avg']]

In [59]:
df.to_csv('df23.csv', index=False)

In [60]:
df.dtypes

product            object
date       datetime64[ns]
min               float64
max               float64
avg               float64
dtype: object

In [61]:
df.date.isnull

<bound method Series.isnull of 0      2024-03-13
1      2024-03-13
2      2024-03-13
3      2024-03-13
4      2024-03-13
          ...
7372   2024-01-01
7373   2024-01-01
7374   2024-01-01
7375   2024-01-01
7376   2024-01-01
Name: date, Length: 7377, dtype: datetime64[ns]>

In [62]:
duplicate_rows = df.duplicated()

print("Duplicate rows:")
print(df[duplicate_rows])

Duplicate rows:
Empty DataFrame
Columns: [product, date, min, max, avg]
Index: []